Revit 2026 API

# RebarPropagationAlignByFace Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ISet<ElementId> AlignByFace(
	Document doc,
	IList<Rebar> sourceRebars,
	Reference sourceFaceReference,
	Reference destinationFaceReference
)
```
```vb
Public Shared Function AlignByFace (
	doc As Document,
	sourceRebars As IList(Of Rebar),
	sourceFaceReference As Reference,
	destinationFaceReference As Reference
) As ISet(Of ElementId)
```
```cpp
public:
static ISet<ElementId^>^ AlignByFace(
	Document^ doc,
	IList<Rebar^>^ sourceRebars,
	Reference^ sourceFaceReference,
	Reference^ destinationFaceReference
)
```
```fsharp
static member AlignByFace :
        doc : Document *
        sourceRebars : IList<Rebar> *
        sourceFaceReference : Reference *
        destinationFaceReference : Reference -> ISet<ElementId>
```

#### Parameters

doc Document

sourceRebars IListRebar

sourceFaceReference Reference

destinationFaceReference Reference

#### Return Value

ISetElementId

#### Reference

RebarPropagation Class

Autodesk.Revit.DB.Structure Namespace